import {useEffect} from "react";
import {login} from "../../services/login.service.ts";

// експортуємо компонент, щоб його можна було використовувати в інших файлах
export const LoginComponent = () => {
    //використовуємо хук, який виконує функцію один раз після першого рендеру компонента
    useEffect(() => {
        // викликаємо функцію, яка робить запит до API для авторизації користувача
        login({
            username: 'emilys', //ім'я користувача
            password: 'emilyspass', //пароль користувача
            expiresInMins: 1 //визначаємо скільки хвилин користувач буде знаходитись в системі
        })
    }, []); //порожній масив означає, що ефект виконається лише один

    return (
        <></>
    );
};